app/views/slots/_show.html.erb

<tr class='slot <% if slot.expired? %>expired-slot<% end %> <% if slot.cancelled %>canceled-slot<%end%>' data-slot="<%= slot.hashed_id %>" >
	<td class='collapse-icon' ><% if slot.subjects.count > 0 %><div class="icon collapse-icon collapsed" data-collapse-element-id="slot-participants-<%= slot.hashed_id %>" > </div><% end %></td>
---
SELECT COUNT(*) AS count_id FROM `subjects` INNER JOIN `appointments` ON `subjects`.id = `appointments`.subject_id WHERE ((`appointments`.slot_id = 2))
SELECT `subjects`.* FROM `subjects` INNER JOIN `appointments` ON `subjects`.id = `appointments`.subject_id WHERE ((`appointments`.slot_id = 1))