app/views/slots/_slot_table.html.erb

SELECT COUNT(*) AS count_id FROM `subjects` INNER JOIN `appointments` ON `subjects`.id = `appointments`.subject_id WHERE ((`appointments`.slot_id = 1))
---
	num_filled += 1 if slot.filled?
    num_subjects += slot.subjects.count