app/views/experiments/show.html.erb

	<%= render :partial => '/slots/slot_table', :locals => {:slots => @experiment.slots, :experiment => @experiment} %>
	<% unless @experiment.slots.empty? %>
---
SELECT `slots`.* FROM `slots` WHERE (`slots`.experiment_id = 1) ORDER BY time