app/controllers/experiments_controller.rb

SELECT `experiments`.* FROM `experiments` WHERE (`experiments`.`user_id` = 9)
SELECT `groups`.* FROM `groups` WHERE (`groups`.`id` = 1) LIMIT 1
---
  def index
    @experiments = Experiment.where(:user_id => current_user.id)
    page_group(current_user.group)

SELECT `experiments`.* FROM `experiments` ORDER BY id DESC
---
  def admin
    @experiments = Experiment.order('id DESC')

SELECT `experiments`.* FROM `experiments` WHERE (`experiments`.user_id = 9)
SELECT `slots`.* FROM `slots` WHERE (`slots`.experiment_id = 1) ORDER BY time
SELECT `groups`.* FROM `groups` WHERE (`groups`.`id` = 1) LIMIT 1
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 9) LIMIT 1
---
  def show
    @experiment = Experiment.obfuscated_query(params[:id]).includes(:slots).first
    page_group(@experiment.user.group)

SELECT `groups`.* FROM `groups` WHERE (`groups`.`id` = 1) LIMIT 1
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 9) LIMIT 1
---
  def filled
    @experiment = Experiment.obfuscated(params[:id])
    page_group(@experiment.user.group)

SELECT `groups`.* FROM `groups` WHERE (`groups`.`id` = 1) LIMIT 1
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 9) LIMIT 1
---
  def participate
    @experiment = Experiment.obfuscated(params[:id])
    page_group(@experiment.user.group)