app/controllers/slots_controller.rb

  def show
    @slot = Slot.obfuscated_query(params[:id]).includes(:experiment).first
    if @slot == nil
      render_404
      return
    end
    @experiment = @slot.experiment
    page_group(@experiment.user.group)
---
SELECT `experiments`.* FROM `experiments` WHERE (`experiments`.user_id = 9)
SELECT `groups`.* FROM `groups` WHERE (`groups`.`id` = 1) LIMIT 1
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 9) LIMIT 1

  def new
    page_title("New Time Slot")
    @slot = Slot.new
    @experiment = Experiment.obfuscated_query(params[:id]).includes(:slots).first
    page_group(@experiment.user.group)
---
SELECT `slots`.* FROM `slots` WHERE (`slots`.experiment_id = 1) ORDER BY time
SELECT `groups`.* FROM `groups` WHERE (`groups`.`id` = 1) LIMIT 1
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 9) LIMIT 1

  def edit
    @slot = Slot.obfuscated(params[:id]).includes(:experiment)
    if @slot.nil?
      render_404
      return
    end
    @experiment = @slot.experiment
    page_group(@experiment.user.group)
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 9) LIMIT 1

  def create
    @slot = Slot.new()
    experiment = Experiment.obfuscated(params[:experiment_id])
    page_group(experiment.user.group)

    if experiment.nil? or !experiment.can_modify?(current_user)
      access_denied
      return
    end
    @slot.experiment = experiment

    @slot.parse_datetime([params[:slot][:date], params[:slot][:time_hour] + ":" + params[:slot][:time_min],
                              params[:slot][:time_12h], experiment.time_zone].join(" "))

    if @slot.save
---
SELECT `groups`.* FROM `groups` WHERE (`groups`.`id` = 1) LIMIT 1
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 9) LIMIT 1
INSERT INTO `slots` (`appointments_count`, `cancelled`, `created_at`, `experiment_id`, `hashed_id`, `lock_version`, `subjects_count`, `time`, `updated_at`) VALUES (0, 0, '2010-11-17 17:41:16', 1, 0, 0, 0, '0010-11-16 17:00:00', '2010-11-17 17:41:16')