app/controllers/subjects_controller.rb

  def new
    @experiment = Experiment.find_by_hashed_id(params[:id], :include => :slots)
    page_group(@experiment.user.group)
---
SELECT `experiments`.* FROM `experiments` WHERE (`experiments`.`hashed_id` = 321060967) LIMIT 1
SELECT `groups`.* FROM `groups` WHERE (`groups`.`id` = 1) LIMIT 1
SELECT `slots`.* FROM `slots` WHERE (`slots`.experiment_id = 1) ORDER BY time
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 9) LIMIT 1

  def dummy_confirmation
    @experiment = Experiment.find_by_hashed_id(params[:id])
    page_group(@experiment.user.group)
---
SELECT `experiments`.* FROM `experiments` WHERE (`experiments`.`hashed_id` = 321060967) LIMIT 1
SELECT `groups`.* FROM `groups` WHERE (`groups`.`id` = 1) LIMIT 1
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 9) LIMIT 1