app/controllers/users_controller.rb

  def index
    page_title("Users")
    if true #self.logged_in?# and self.user_admin?
      @users = User.all
---
SELECT `users`.* FROM `users`